case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 -32) 	//0
    (650 0 -32)	//1
    (650 350 -32)	//2
    (0 350 -32)	//3
    
    (0 0 32) 	//0
    (650 0 32)	//1
    (650 350 32)	//2
    (0 350 32)	//3
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 5) simpleGrading (1 1 1)
);

edges	
(
);

boundary
(
    topAndBottom
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (0 1 5 4)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    frontAndBack
    {
        type patch;
        faces
        (
            (4 5 6 7)
            (0 3 2 1)
        );
    }
);


// ************************************************************************* //
